// @ts-nocheck

// ---------------------------------------------------------------------------------
// 📌 void 타입
// ⭐️ URL : https://bit.ly/3DXncry
// ---------------------------------------------------------------------------------
// - void는 "아무 것도 반환하지 않는 함수"의 반환 타입입니다.
// - 이 함수는 "데이터가 없다"는 의미입니다.
// - TypeScript는 함수 반환값에 대한 타입을 잘 추론하지만,
//   때때로 반환 값 타입을 명시적으로 지정하지 않아야 하는 경우도 있습니다.
// ---------------------------------------------------------------------------------

{
  // 함수의 용도와 다른 반환 값이 존재할 경우,
  // TypeScript는 이를 자동 추론합니다.
  function printTwice(message: string) {
    console.log(message);
    console.log(message);
    return '';
  }
}

{
  // 아래 오류가 발생한 이유는 명시적으로 반환 값의 타입이 void 임을 지정했기 때문입니다.
  function printMessage(message: string): void {
    console.log(message);
    return '';
  }
}
